app/controllers/capexes_controller.rb

  def index
    @capexes = Capex.all
---
SELECT `capexes`.* FROM `capexes`

  def create
    @capex = Capex.new(capex_params)

    respond_to do |format|
      if @capex.save
---
INSERT INTO `capexes` (`amount`, `created_at`, `description`, `ex_type`, `title`, `updated_at`) VALUES (30000.0, '2014-08-16 19:25:59', 'House load EMI for the month of August', 1, 'House Loan EMI', '2014-08-16 19:25:59')

  def update
    respond_to do |format|
      if @capex.update(capex_params)
---
UPDATE `capexes` SET `title` = 'Dinner at Taj', `description` = 'Dinner with family at Taj', `amount` = 6000.0, `updated_at` = '2014-08-17 12:47:13' WHERE `capexes`.`id` = 6

  def destroy
    @capex.destroy
---
DELETE FROM `capexes` WHERE `capexes`.`id` = 8

    def set_capex
      @capex = Capex.find(params[:id])
---
SELECT `capexes`.* FROM `capexes` WHERE `capexes`.`id` = 8 LIMIT 1